Revit 2027 API
IndependentTag.HasLeaderElbow Method
 Whether the tag's leader that points to the reference has an elbow point or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasLeaderElbow(
	Reference referenceTagged
)
Public Function HasLeaderElbow (
	referenceTagged As Reference
) As Boolean
public:
bool HasLeaderElbow(
	Reference^ referenceTagged
)
member HasLeaderElbow :
        referenceTagged : Reference -> bool
Parameters
referenceTagged Reference
Return Value
Boolean
 True if the reference has a leader with an elbow point, or false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The specified reference is not currently tagged. -or- The leader for the tagged reference isn't visible.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace